In [1]:
#main tool while working with pandas

In [2]:
import numpy as np

In [6]:
import pandas as pd

In [7]:
from numpy.random import randn

In [21]:
np.random.seed(0)#that make sure we can get the same random number every time
#makes the random numbers predictable

In [40]:
np.random.seed(2);np.random.rand(4)#With the seed reset (every time),
#the same set of numbers will appear every time.

array([0.4359949 , 0.02592623, 0.54966248, 0.43532239])

In [78]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['Ser1','Ser2','Ser3','Ser4'])

In [50]:
df#this contain a banch of series sharing the same index

       Ser1      Ser2      Ser3      Ser4
A -2.040323  0.046256 -0.677676 -1.439439
B  0.524296  0.735280 -0.653250  0.842456
C -0.381516  0.066489 -1.098739  1.584487
D -2.659449 -0.091453  0.695120 -2.033467
E -0.189469 -0.077219  0.824703  1.248213

In [51]:
df['Ser1']

A   -2.040323
B    0.524296
C   -0.381516
D   -2.659449
E   -0.189469
Name: Ser1, dtype: float64

In [53]:
type(df['Ser1'])

pandas.core.series.Series

In [54]:
type(df)

pandas.core.frame.DataFrame

In [55]:
df.Ser1#not recommanded

A   -2.040323
B    0.524296
C   -0.381516
D   -2.659449
E   -0.189469
Name: Ser1, dtype: float64

In [56]:
df[['Ser1','Ser2']]# to get a two column pass the name of it as list

       Ser1      Ser2
A -2.040323  0.046256
B  0.524296  0.735280
C -0.381516  0.066489
D -2.659449 -0.091453
E -0.189469 -0.077219

In [57]:
type(df[['Ser1','Ser2']])

pandas.core.frame.DataFrame

In [59]:
#df['New'] #this will raise KeyError like dict

In [75]:
df['New']=df['Ser1']+df['Ser2']

In [62]:
df

       Ser1      Ser2      Ser3      Ser4       New
A -2.040323  0.046256 -0.677676 -1.439439 -1.994068
B  0.524296  0.735280 -0.653250  0.842456  1.259576
C -0.381516  0.066489 -1.098739  1.584487 -0.315027
D -2.659449 -0.091453  0.695120 -2.033467 -2.750902
E -0.189469 -0.077219  0.824703  1.248213 -0.266688

In [64]:
df.drop('New',axis=1)# to remove column axis=1 column and axis=0 for rows

       Ser1      Ser2      Ser3      Ser4
A -2.040323  0.046256 -0.677676 -1.439439
B  0.524296  0.735280 -0.653250  0.842456
C -0.381516  0.066489 -1.098739  1.584487
D -2.659449 -0.091453  0.695120 -2.033467
E -0.189469 -0.077219  0.824703  1.248213

In [65]:
df#still not delete because we miss using inplace=True to delete it and pandas use it to not loss data

       Ser1      Ser2      Ser3      Ser4       New
A -2.040323  0.046256 -0.677676 -1.439439 -1.994068
B  0.524296  0.735280 -0.653250  0.842456  1.259576
C -0.381516  0.066489 -1.098739  1.584487 -0.315027
D -2.659449 -0.091453  0.695120 -2.033467 -2.750902
E -0.189469 -0.077219  0.824703  1.248213 -0.266688

In [67]:
df.drop('New',axis=1 ,inplace=True)

In [68]:
df# now it deleted

       Ser1      Ser2      Ser3      Ser4
A -2.040323  0.046256 -0.677676 -1.439439
B  0.524296  0.735280 -0.653250  0.842456
C -0.381516  0.066489 -1.098739  1.584487
D -2.659449 -0.091453  0.695120 -2.033467
E -0.189469 -0.077219  0.824703  1.248213

In [69]:
df.drop('E')#we not use axis becuase it default for 0 and this not delete data as real

       Ser1      Ser2      Ser3      Ser4
A -2.040323  0.046256 -0.677676 -1.439439
B  0.524296  0.735280 -0.653250  0.842456
C -0.381516  0.066489 -1.098739  1.584487
D -2.659449 -0.091453  0.695120 -2.033467

In [77]:
df

       Ser1      Ser2      Ser3      Ser4       New
A -2.040323  0.046256 -0.677676 -1.439439 -1.994068
B  0.524296  0.735280 -0.653250  0.842456  1.259576
C -0.381516  0.066489 -1.098739  1.584487 -0.315027
D -2.659449 -0.091453  0.695120 -2.033467 -2.750902

In [71]:
df.drop('E',axis=0,inplace=True)

In [79]:
df.shape

(5, 4)

In [80]:
df.loc['A']# it return series sow column and rows are series and remember to use [] not() :))

Ser1   -0.403892
Ser2   -1.384519
Ser3    1.367235
Ser4    1.217886
Name: A, dtype: float64

In [81]:
df.iloc[0]#to locate using index

Ser1   -0.403892
Ser2   -1.384519
Ser3    1.367235
Ser4    1.217886
Name: A, dtype: float64

In [82]:
df

       Ser1      Ser2      Ser3      Ser4
A -0.403892 -1.384519  1.367235  1.217886
B -0.462005  0.350888  0.381866  0.566275
C  0.204208  1.406696 -1.737960  1.040824
D  0.380472 -0.217135  1.173531 -2.343603
E  1.161521  0.386078 -1.133133  0.433093

In [83]:
df.loc['A','Ser1']

-0.4038922693379395

In [85]:
df.loc[['A'],['Ser1','Ser2']]

       Ser1      Ser2
A -0.403892 -1.384519

In [88]:
df < 0

    Ser1   Ser2   Ser3   Ser4
A   True   True  False  False
B   True  False  False  False
C  False  False   True  False
D  False   True  False   True
E  False  False   True  False

In [90]:
df[df > 0]

       Ser1      Ser2      Ser3      Ser4
A       NaN       NaN  1.367235  1.217886
B       NaN  0.350888  0.381866  0.566275
C  0.204208  1.406696       NaN  1.040824
D  0.380472       NaN  1.173531       NaN
E  1.161521  0.386078       NaN  0.433093

In [91]:
df['Ser1']>0

A    False
B    False
C     True
D     True
E     True
Name: Ser1, dtype: bool

In [92]:
df['Ser1']

A   -0.403892
B   -0.462005
C    0.204208
D    0.380472
E    1.161521
Name: Ser1, dtype: float64

In [93]:
df[df['Ser1']>0]#this will remove all rows that less than zeros and will not back with Nan

       Ser1      Ser2      Ser3      Ser4
C  0.204208  1.406696 -1.737960  1.040824
D  0.380472 -0.217135  1.173531 -2.343603
E  1.161521  0.386078 -1.133133  0.433093

In [94]:
df

       Ser1      Ser2      Ser3      Ser4
A -0.403892 -1.384519  1.367235  1.217886
B -0.462005  0.350888  0.381866  0.566275
C  0.204208  1.406696 -1.737960  1.040824
D  0.380472 -0.217135  1.173531 -2.343603
E  1.161521  0.386078 -1.133133  0.433093

In [96]:
df[df['Ser4']<0]

       Ser1      Ser2      Ser3      Ser4
D  0.380472 -0.217135  1.173531 -2.343603

In [99]:
df[df['Ser1']>0]['Ser2']

C    1.406696
D   -0.217135
E    0.386078
Name: Ser2, dtype: float64

In [103]:
df[df['Ser1']>0]

       Ser1      Ser2      Ser3      Ser4
C  0.204208  1.406696 -1.737960  1.040824
D  0.380472 -0.217135  1.173531 -2.343603
E  1.161521  0.386078 -1.133133  0.433093

In [104]:
df['Ser1']

A   -0.403892
B   -0.462005
C    0.204208
D    0.380472
E    1.161521
Name: Ser1, dtype: float64

In [105]:
df

       Ser1      Ser2      Ser3      Ser4
A -0.403892 -1.384519  1.367235  1.217886
B -0.462005  0.350888  0.381866  0.566275
C  0.204208  1.406696 -1.737960  1.040824
D  0.380472 -0.217135  1.173531 -2.343603
E  1.161521  0.386078 -1.133133  0.433093

In [106]:
df[(df['Ser1']>0) and (df['Ser2']>0)]# will raise error (The truth value of a Series is ambiguous)
#and the right way is that we use &

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [108]:
df[(df['Ser1']>0) & (df['Ser3']>0)]

       Ser1      Ser2      Ser3      Ser4
D  0.380472 -0.217135  1.173531 -2.343603

In [109]:
df

       Ser1      Ser2      Ser3      Ser4
A -0.403892 -1.384519  1.367235  1.217886
B -0.462005  0.350888  0.381866  0.566275
C  0.204208  1.406696 -1.737960  1.040824
D  0.380472 -0.217135  1.173531 -2.343603
E  1.161521  0.386078 -1.133133  0.433093

In [110]:
df[(df['Ser1']>0) | (df['Ser3']>0)]

       Ser1      Ser2      Ser3      Ser4
A -0.403892 -1.384519  1.367235  1.217886
B -0.462005  0.350888  0.381866  0.566275
C  0.204208  1.406696 -1.737960  1.040824
D  0.380472 -0.217135  1.173531 -2.343603
E  1.161521  0.386078 -1.133133  0.433093

In [111]:
df.reset_index()#to reset index to default like 0 , 1 ,0 to run it use inplace=True

  index      Ser1      Ser2      Ser3      Ser4
0     A -0.403892 -1.384519  1.367235  1.217886
1     B -0.462005  0.350888  0.381866  0.566275
2     C  0.204208  1.406696 -1.737960  1.040824
3     D  0.380472 -0.217135  1.173531 -2.343603
4     E  1.161521  0.386078 -1.133133  0.433093

In [112]:
newind = 'ab ah be da mo'.split()

In [113]:
df['names']=newind

In [114]:
df

       Ser1      Ser2      Ser3      Ser4 names
A -0.403892 -1.384519  1.367235  1.217886    ab
B -0.462005  0.350888  0.381866  0.566275    ah
C  0.204208  1.406696 -1.737960  1.040824    be
D  0.380472 -0.217135  1.173531 -2.343603    da
E  1.161521  0.386078 -1.133133  0.433093    mo

In [125]:
df.set_index('names').loc['ab']

Ser1   -0.403892
Ser2   -1.384519
Ser3    1.367235
Ser4    1.217886
Name: ab, dtype: float64

In [126]:
df.set_index('names')

           Ser1      Ser2      Ser3      Ser4
names
ab    -0.403892 -1.384519  1.367235  1.217886
ah    -0.462005  0.350888  0.381866  0.566275
be     0.204208  1.406696 -1.737960  1.040824
da     0.380472 -0.217135  1.173531 -2.343603
mo     1.161521  0.386078 -1.133133  0.433093